tsung.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info">
  <clients>
    <client host="localhost" maxusers="20000" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="192.168.59.100" port="30070" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="600" unit="second">
      <users arrivalrate="300" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="600" unit="second">
      <users arrivalrate="500" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="load_test" probability="100" type="ts_http">
      <request>
        <http url="http://192.168.59.100:30070/api/logentries" method="GET"/>
      </request>
    </session>
  </sessions>
</tsung>